Revit 2024 API
BuiltInFailures.DimensionFailures.RadialDimensionCannotProjectToArc Property
 Cannot form radial dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RadialDimensionCannotProjectToArc { get; }
Visual Basic
Public Shared ReadOnly Property RadialDimensionCannotProjectToArc As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RadialDimensionCannotProjectToArc {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace